DanielMartensson/STM32-Computer/Firmware/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/drivers/st/clk/stm32mp1_clk.c
	assert(pllcfg != NULL);
	assert(fracv != NULL);

	switch (clksrc) {
	case CLK_PLL12_HSI:
		input_freq = stm32mp_clk_get_rate(CK_HSI);
		break;
	case CLK_PLL12_HSE:
		input_freq = stm32mp_clk_get_rate(CK_HSE);
		break;
	default:
		break;
	}

	if (input_freq == 0UL) {
		panic();
	}

	return clk_compute_pll1_settings(input_freq, freq_khz, pllcfg, fracv);
}

static int stm32_clk_dividers_configure(struct stm32_clk_priv *priv)
{
	struct stm32_clk_platdata *pdata = priv->pdata;
	uint32_t i;

	for (i = 0U; i < pdata->nclkdiv; i++) {
		uint32_t div_id, div_n;
		uint32_t val;
		int ret;

		val = pdata->clkdiv[i] & CMD_DATA_MASK;
		div_id = (val & DIV_ID_MASK) >> DIV_ID_SHIFT;
		div_n = (val & DIV_DIVN_MASK) >> DIV_DIVN_SHIFT;

		ret = clk_stm32_set_div(priv, div_id, div_n);
		if (ret != 0) {
			return ret;
		}
	}

	return 0;
}

static int stm32_clk_configure_clk(struct stm32_clk_priv *priv, uint32_t data)
{
	uint32_t sel = (data & CLK_SEL_MASK) >> CLK_SEL_SHIFT;
	uint32_t enable = (data & CLK_ON_MASK) >> CLK_ON_SHIFT;
	unsigned long binding_id = ((unsigned long)data & CLK_ID_MASK) >> CLK_ID_SHIFT;
	struct stm32_clk_platdata *pdata = priv->pdata;

	if (binding_id == RTC) {
		uintptr_t address = stm32mp_rcc_base() + RCC_BDCR;

		if (((mmio_read_32(address) & RCC_BDCR_RTCCKEN) == 0U) || (enable != 0U)) {
			mmio_clrsetbits_32(address, RCC_BDCR_RTCSRC_MASK,
					   (sel & RCC_SELR_SRC_MASK) << RCC_BDCR_RTCSRC_SHIFT);

			mmio_setbits_32(address, RCC_BDCR_RTCCKEN);
			/* Configure LSE CSS */
			if (pdata->lse_css) {
				mmio_setbits_32(priv->base + RCC_BDCR, RCC_BDCR_LSECSSON);
			}
		}
	}

	return 0;
}

static int stm32_clk_configure_by_addr_val(struct stm32_clk_priv *priv,
					   uint32_t data)
{
	uint32_t addr = data >> CLK_ADDR_SHIFT;
	uint32_t val = data & CLK_ADDR_VAL_MASK;

	mmio_setbits_32(priv->base + addr, val);

	return 0;
}

static int stm32_clk_source_configure(struct stm32_clk_priv *priv)
{
	struct stm32_clk_platdata *pdata = priv->pdata;
	bool ckper_disabled = false;
	uint32_t i;

	for (i = 0U; i < pdata->nclksrc; i++) {
		uint32_t val = pdata->clksrc[i];
		uint32_t cmd, cmd_data;
		int ret;

		if (val & CMD_ADDR_BIT) {
			ret = stm32_clk_configure_by_addr_val(priv, val & ~CMD_ADDR_BIT);
			if (ret != 0) {
				return ret;
			}

			continue;
		}

		if (val == (uint32_t)CLK_CKPER_DISABLED) {
			ckper_disabled = true;
			continue;
		}

		cmd = (val & CMD_MASK) >> CMD_SHIFT;
		cmd_data = val & ~CMD_MASK;

		switch (cmd) {
		case CMD_MUX:
			ret = stm32_clk_configure_mux(priv, cmd_data);
			break;

		case CMD_CLK:
			ret = stm32_clk_configure_clk(priv, cmd_data);
			break;
		default:
			ret = -EINVAL;
			break;
		}

		if (ret != 0) {
			return ret;
		}
	}

	/*
	 * CKPER is source for some peripheral clocks
	 * (FMC-NAND / QPSI-NOR) and switching source is allowed
	 * only if previous clock is still ON
	 * => deactivate CKPER only after switching clock
	 */
	if (!ckper_disabled) {
		return 0;
	}

	return stm32_clk_configure_mux(priv, CLK_CKPER_DISABLED);
}

static int stm32mp1_pll_configure_src(struct stm32_clk_priv *priv, int pll_idx)
{
	struct stm32_clk_platdata *pdata = priv->pdata;
	struct stm32_pll_dt_cfg *pll_conf = &pdata->pll[pll_idx];

	if (!pll_conf->status) {
		return 0;
	}

	return stm32_clk_configure_mux(priv, pll_conf->src);
}

int stm32mp1_clk_init(uint32_t pll1_freq_khz)
{
	struct stm32_clk_priv *priv = clk_stm32_get_priv();
	struct stm32_clk_platdata *pdata = priv->pdata;
	struct stm32_pll_dt_cfg *pll_conf = pdata->pll;
	int ret;
	enum stm32mp1_pll_id i;
	bool pll3_preserve = false;
	bool pll4_preserve = false;
	bool pll4_bootrom = false;
	int stgen_p = stm32mp1_clk_get_parent(STGEN_K);
	int usbphy_p = stm32mp1_clk_get_parent(USBPHY_K);
	uint32_t usbreg_bootrom = 0U;

	if ((!pll_conf[_PLL1].status) && (pll1_freq_khz != 0U)) {
		ret = clk_get_pll1_settings(pll_conf[_PLL2].src, pll1_freq_khz,
					    pll_conf[_PLL1].cfg, &pll_conf[_PLL1].frac);
		if (ret != 0) {
			return ret;
		}

		pll_conf[_PLL1].status = true;
		pll_conf[_PLL1].src = pll_conf[_PLL2].src;
	}

	/*
	 * Switch ON oscillator found in device-tree.
	 * Note: HSI already ON after BootROM stage.
	 */
	if (stm32mp1_osc[_LSI] != 0U) {
		stm32mp1_lsi_set(true);
	}
	if (stm32mp1_osc[_LSE] != 0U) {
		const char *name = stm32mp_osc_node_label[_LSE];
		bool bypass, digbyp;
		uint32_t lsedrv;

		bypass = fdt_clk_read_bool(name, "st,bypass");
		digbyp = fdt_clk_read_bool(name, "st,digbypass");
		pdata->lse_css = fdt_clk_read_bool(name, "st,css");
		lsedrv = fdt_clk_read_uint32_default(name, "st,drive",
						     LSEDRV_MEDIUM_HIGH);
		stm32mp1_lse_enable(bypass, digbyp, lsedrv);
	}
	if (stm32mp1_osc[_HSE] != 0U) {
		const char *name = stm32mp_osc_node_label[_HSE];
		bool bypass, digbyp, css;

		bypass = fdt_clk_read_bool(name, "st,bypass");
		digbyp = fdt_clk_read_bool(name, "st,digbypass");
		css = fdt_clk_read_bool(name, "st,css");
		stm32mp1_hse_enable(bypass, digbyp, css);
	}
	/*
	 * CSI is mandatory for automatic I/O compensation (SYSCFG_CMPCR)
	 * => switch on CSI even if node is not present in device tree
	 */
	stm32mp1_csi_set(true);

	/* Come back to HSI */
	ret = stm32_clk_configure_mux(priv, CLK_MPU_HSI);
	if (ret != 0) {
		return ret;
	}
	ret = stm32_clk_configure_mux(priv, CLK_AXI_HSI);
	if (ret != 0) {
		return ret;
	}
	ret = stm32_clk_configure_mux(priv, CLK_MCU_HSI);
	if (ret != 0) {
		return ret;
	}
	if ((mmio_read_32(priv->base + RCC_MP_RSTSCLRR) &
	     RCC_MP_RSTSCLRR_MPUP0RSTF) != 0) {
		pll3_preserve = stm32mp1_check_pll_conf(_PLL3,
							pll_conf[_PLL3].src,
							pll_conf[_PLL3].cfg,
							pll_conf[_PLL3].frac);
		pll4_preserve = stm32mp1_check_pll_conf(_PLL4,
							pll_conf[_PLL4].src,
							pll_conf[_PLL4].cfg,
							pll_conf[_PLL4].frac);
	}
	/* Don't initialize PLL4, when used by BOOTROM */
	if ((stm32mp_get_boot_itf_selected() ==
	     BOOT_API_CTX_BOOT_INTERFACE_SEL_SERIAL_USB) &&
	    ((stgen_p == (int)_PLL4_R) || (usbphy_p == (int)_PLL4_R))) {
		pll4_bootrom = true;
		pll4_preserve = true;
	}

	for (i = (enum stm32mp1_pll_id)0; i < _PLL_NB; i++) {
		if (((i == _PLL3) && pll3_preserve) ||
		    ((i == _PLL4) && pll4_preserve)) {
			continue;
		}

		ret = stm32mp1_pll_stop(i);
		if (ret != 0) {
			return ret;
		}
	}

	/* Configure HSIDIV */
	if (stm32mp1_osc[_HSI] != 0U) {
		ret = stm32mp1_hsidiv(stm32mp1_osc[_HSI]);
		if (ret != 0) {
			return ret;
		}

